{
	"Amateur Auteur": [{}, {}, {}, {}],
	"Beast in Show": [{}, {}, {}, {}],
	"Everythingamajig": [
		{
			"manaCost": "{5}",
			"text": "{2}, {T}: Move a counter from one permanent onto another. If the second permanent refers to any kind of counter, the moved counter becomes one of those counters. Otherwise, it becomes a +1/+1 counter.\n{3}, {T}: Put a +1/+1 counter on target creature.\n{4}, {T}: Proliferate. (You choose any number of permanents and/or players with counters on them, then give each another counter of a kind already there.)"
		},
		{
			"manaCost": "{5}",
			"text": "{2}, {T}: Draw a card. Activate this ability only if you have no cards in hand.\n{8}, {T}: You gain 10 life.\n{4}, {T}, Sacrifice Everythingamajig: You may put a silver-bordered permanent card from your hand onto the battlefield."
		},
		{
			"manaCost": "{5}",
			"text": "{1}: Flip a coin. If you win the flip, add {C}{C} to your mana pool. Activate this ability only any time you could cast an instant.\n{3}, {T}: Target player discards a card. Activate this ability only during your turn.\n{X}: Everythingamajig becomes an X/X Construct artifact creature until end of turn."
		},
		{
			"manaCost": "{6}",
			"text": "{T}: Add one mana of any color to your mana pool.\n{1}, {T}: Say the flavor text on a card in your hand. Target opponent guesses that card's name. You may reveal that card. If you do and your opponent guessed wrong, draw a card.\n{8}, {T}: Everythingamajig deals 12 damage to target creature."
		},
		{
			"manaCost": "{5}",
			"text": "Sacrifice a land: You gain 2 life.\nSacrifice a creature: Add {C}{C} to your mana pool.\n{2}, Discard a card: Search your library for a card that shares a complete word in its name with the name of the discarded card, reveal it, put it into your hand, then shuffle your library."
		},
		{
			"manaCost": "{8}",
			"text": "{1}, {T}: Scry 2.\n{1}, {T}, Pay 1 life: Create a 0/1 white Goat creature token.\n{7}, {T}, Sacrifice Everythingamajig: Choose target player. At the beginning of the next end step, exchange life totals with that player, exchange control of all permanents you and that player control, and exchange cards in your hands, cards in your libraries, and cards in your graveyards."
		}
	],
	"Extremely Slow Zombie": [{}, {}, {}, {}],
	"Garbage Elemental": [
		{
			"text": "Frenzy 2 (Whenever this creature attacks and isn't blocked, it gets +2/+0 until end of turn.)\nGarbage Elemental can't be blocked by wordy creatures. (A creature is wordy if it has four or more lines of rules text.)",
			"subtypes": ["Elemental"],
			"power": "2", "toughness": "4"
		},
		{
			"text": "When Garbage Elemental enters the battlefield, it assembles a Contraption. (Put the top card of your Contraption deck face up onto one of your sprockets.)\nUndying (When this creature dies, if it had no +1/+1 counters on it, return it to the battlefield under its owner's control with a +1/+1 counter on it.)",
			"subtypes": ["Elemental", "Rigger"],
			"power": "3", "toughness": "1"
		},
		{
			"text": "Battle cry (Whenever this creature attacks, each other attacking creature gets +1/+0 until end of turn.)\nWhen Garbage Elemental enters the battlefield, roll two six-sided dice. Create a number of 1/1 red Goblin creature tokens equal to the difference between those results.",
			"subtypes": ["Elemental"],
			"power": "3", "toughness": "2"
		},
		{
			"text": "Cascade (When you cast this spell, exile cards from the top of your library until you exile a nonland card that costs less. You may cast it without paying its mana cost. Put the exiled cards on the bottom of your library in a random order.)\nWhen Garbage Elemental enters the battlefield, roll a six-sided die. Garbage Elemental deals damage equal to the result to target opponent.",
			"subtypes": ["Elemental"],
			"power": "3", "toughness": "3"
		},
		{
			"text": "Unleash (You may have this creature enter the battlefield with a +1/+1 counter on it. It can't block as long as it has a +1/+1 counter on it.)\nEach creature you control with any kind of counter on it has art menace. (They can't be blocked except by creatures with two or more visible figures in their art.)",
			"subtypes": ["Elemental"],
			"power": "4", "toughness": "3"
		},
		{
			"text": "Last strike (This creature deals combat damage after creatures without last strike.)\nBattalion — Whenever Garbage Elemental and at least two other creatures attack, target creature can't block this turn.",
			"subtypes": ["Elemental"],
			"power": "6", "toughness": "5"
		}
	],
	"Ineffable Blessing": [
		{
			"text": "As Ineffable Blessing enters the battlefield, choose Flavorful or Bland.\n• Flavorful — Whenever a creature with flavor text enters the battlefield under your control, draw a card.\n• Bland — Whenever a creature without flavor text enters the battlefield under your control, draw a card."
		},
		{
			"text": "As Ineffable Blessing enters the battlefield, choose an artist.\nWhenever a creature with art by the chosen artist enters the battlefield under your control, draw a card."
		},
		{
			"text": "As Ineffable Blessing enters the battlefield, choose white-bordered or silver-bordered.\nWhenever a creature with the chosen border enters the battlefield under your control, draw a card."
		},
		{
			"text": "As Ineffable Blessing enters the battlefield, choose a rarity.\nWhenever a creature with the chosen rarity enters the battlefield under your control, draw a card."
		},
		{
			"text": "As Ineffable Blessing enters the battlefield, choose odd or even.\nWhenever a creature with a collector number of the chosen value enters the battlefield under your control, draw a card."
		},
		{
			"text": "As Ineffable Blessing enters the battlefield, choose a number.\nWhenever a creature with exactly the chosen number of words in its name enters the battlefield under your control, draw a card. (Hyphenated words are one word.)"
		}
	],
	"Curious Killbot": [
		{"name": "Curious Killbot"},
		{"name": "Delighted Killbot"},
		{"name": "Despondent Killbot"},
		{"name": "Enraged Killbot"}
	],
	"Knight of the Kitchen Sink": [
		{
			"text": "First strike, protection from black borders {Nothing with a black border can block, target, deal damage to, or attach to this creature.)"
		},
		{
			"text": "First strike, protection from even collector numbers {Nothing with an even collector number can block, target, deal damage to, or attach to this creature.)"
		},
		{
			"text": "First strike, protection from loose lips {Nothing with an open mouth in its artwork can block, target, deal damage to, or attach to this creature.)"
		},
		{
			"text": "First strike, protection from odd collector numbers {Nothing with an odd collector number can block, target, deal damage to, or attach to this creature.)"
		},
		{
			"text": "First strike, protection from two-word names {Nothing with exactly two words in its name can block, target, deal damage to, or attach to this creature. Hyphenated words are one word.)"
		},
		{
			"text": "First strike, protection from watermarks {Nothing with a watermark can block, target, deal damage to, or attach to this creature.)"
		}
	],
	"Novellamental": [{}, {}, {}, {}],
	"Secret Base": [{}, {}, {}, {}, {}],
	"Sly Spy": [
		{
			"text": "Whenever Sly Spy deals combat damage to a player, that player reveals his or her hand. You choose a card from it with the longest name. That player discards that card."
		},
		{
			"text": "Whenever Sly Spy deals combat damage to a player, you may destroy target creature facing left in its art. (Creatures without faces don't face anywhere.)"
		},
		{
			"text": "Whenever Sly Spy deals combat damage to a player, that player loses a finger until Sly Spy leaves the battlefield. (The finger is chosen by its owner and can't roll dice or touch cards.)"
		},
		{
			"text": "Whenever Sly Spy deals combat damage to a player, you may destroy target creature facing right in its art. (Creatures without faces don't face anywhere.)"
		},
		{
			"text": "Whenever Sly Spy deals combat damage to a player, that player reveals the top card of his or her library. Put that card into your hand and you lose life equal to its converted mana cost."
		},
		{
			"text": "Whenever Sly Spy deals combat damage to a player, roll a six-sided die. That player loses life equal to the result."
		}
	],
	"Target Minotaur": [{}, {}, {}, {}],
	"Very Cryptic Command": [
		{
			"text": "Choose two —\n• Switch target creature's power and toughness until end of turn\n• Target creature can't be blocked this turn.\n• Draw a card. If that card's art is by Wayne England, you may reveal it and draw another card.\n• Assemble a Contraption."
		},
		{
			"text": "Choose two —\n• Untap two target permanents.\n• Tap each permanent target player controls with exactly one word in its name.\n• Discard all the cards in your hand, then draw that many cards.\n• Return target instant or sorcery card from your graveyard to your hand."
		},
		{
			"text": "Choose two —\n• Draw a card from an opponent's library\n• Copy target instant or sorcery spell. You may choose new targets for the copy.\n• Until end of turn, target creature loses all abilities and becomes a blue Frog with base power and toughness 1/1.\n• Create a 1/1 colorless Gnome artifact creature token."
		},
		{
			"text": "Choose two —\n• Return target permanent to its controller's hand.\n• Draw two cards, then discard a card.\n• Change the target of target spell with a single target.\n• Turn over target nontoken creature."
		},
		{
			"text": "Choose two —\n• Counter target black-bordered spell.\n• Return target creature to its owner's hand.\n• Untap each permanent you control with a watermark.\n• Roll two six-sided dice. Target player puts the top X cards of his or her library into his or her graveyard, where X is the total of those results."
		},
		{
			"text": "Choose two —\n• Scry 3.\n• Create a 2/2 black Rogue creature token with menace.\n• Add or subtract 1 or one from a number or number word on target spell or permanent until end of turn.\n• Return all artifacts target player controls to their owner's hand."
		}
	]
}
